app/controllers/admin/beats_controller.rb

  def index
    @beats = Beat.all
---
SELECT "beats".* FROM "beats" WHERE (state = 'pending')

  def create
    @beat = Beat.new(params[:beat])
    if @beat.save
---
INSERT INTO "beats" ("beat_content_type", "beat_file_name", "beat_file_size", "beat_updated_at", "created_at", "genre", "name", "price", "state", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"

  def edit
    @beat = Beat.find(params[:id])
---
SELECT "beats".* FROM "beats" WHERE "beats"."id" = $1 LIMIT 1  [["id", "28"]]

  def update
    @beat = Beat.find(params[:id])
    @beat.approve
    if @beat.update_attributes(params[:beat])
---
SELECT "beats".* FROM "beats" WHERE "beats"."id" = $1 LIMIT 1  [["id", "28"]]
UPDATE "beats" SET "state" = 'approved', "updated_at" = '2013-07-02 23:59:28.528227' WHERE "beats"."id" = 28