app/controllers/beats_controller.rb

  def create
    @beat = Beat.new(params[:beat])
    if @beat.save
---
INSERT INTO "beats" ("beat_content_type", "beat_file_name", "beat_file_size", "beat_updated_at", "created_at", "genre", "name", "price", "state", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"